---------------------------------------------------------------
---------------Set operators: UNION.INTERSECT, EXCEPT----------
-----------------------1. UNION -------------------------------
/*Резултатните набори, които се обединяват, трябва да отговарят 
на следните условия:
	-Всяка заявка в оператора UNION трябва да има еднакъв 
	-брой колони; 
	-Колоните трябва да имат съвместими типове от данни;
	-ORDER BY накрая, а в целия израз може да присъства 
	само една клауза сортираща обединения резултат. */

--Пример 4-5. 
	--Да се изведат идентификаторите на държавите, в които 
	--има клиенти или отдели на фирмата.

	select COUNTRY_ID from CUSTOMERS
	union
	select COUNTRY_ID from DEPARTMENTS

--Пример 4-6. 
	--Да се изведат идентификаторите на държавите, в които има 
	--клиенти или отдели на фирмата. Нека в резултатния 
	--набор участват и дублиращите се записи.

	select COUNTRY_ID from CUSTOMERS
	union all
	select COUNTRY_ID from DEPARTMENTS

/*Задача 4-4. 
	Да се изведат всички малки имена на клиенти и служители с
	 евентуалните повторения, сортирани в низходящ ред по име. */

	 select fname from CUSTOMERS
	 union all
	 select fname from EMPLOYEES
	 order by fname desc

/*Задача 4-5.
	Да се изведат име и фамилия на клиенти и служители без 
	повторения,
	а като трета колона за клиентите да се използва израз,
	генериращ низа „Клиент (<идентификатор>)“, 
	за служителите – „Служител (<идентификатор>)“. */

	select FNAME, LNAME, 'Клиент (' + Country_ID + ')' from CUSTOMERS
	union
	select FNAME, LNAME, 'Служител (' + CAST(JOB_ID as varchar) + ')' from EMPLOYEES

------------------------2. INTERSECT(сечение)------------------
/*Резултатът съдържа общите за двата резултатни набора 
редове, без дубликати. Условия:
	-Броят на колоните във всички заявки трябва да бъде еднакъв;
	-Колоните трябва да бъдат от съвместими типове от данни.*/

--Пример 4-7. 
--Да се изведат ID на държавите, в които има клиенти
--и отдели на фирмата едновременно.

	select COUNTRY_ID from COUNTRIES
	intersect
	select COUNTRY_ID from DEPARTMENTS

--Задача 4-6. 
--Да се изведат общите собствени имена на клиенти
--и служители.

	select FNAME from CUSTOMERS
	intersect
	select FNAME from EMPLOYEES

------------------------3. EXCEPT------------------------------
/*връща редовете, върнати от първата заявка, които не се
срещат измежду редове от втората. Условия:
	-Броят на колоните във двете заявки трябва да бъде еднакъв;
	-Колоните трябва да бъдат от съвместими типове от данни. */

--Пример 4-8. 
--Изведи id на държавите, в които има
--клиенти и в същото време няма отдели на фирмата.

/*Задача 4-7. 
--Да се изведат собствени имена на клиенти, 
които не се срещат сред тези на служители.*/

 --Изведи идентификаторите на всички продукти, 
 --които не са поръчвани (по поне 2 начина).